const Znaki= new Object();
Znaki.normal= ["A", "a", "B", "b", "C", "c", "D", "d", "E", "e", "F", "f", "G", "g", "H", "h", "I", "i", "J", "j", "K", "k", "L", "l", "N", "n", "M", "m", "O", "o", "P", "p", "Q", "q", "R", "r", "S", "s", "T", "t", "U", "u", "V", "v", "W", "w", "X", "x", "Y", "y", "Z", "z", "1", "2", "3", "4", "5", "6", "7", "8", "9", "0", `"`, `!`, `?`, `,`, `(`, `)`];
Znaki.OldEnglish= ["𝔄", "𝔞", "𝔅", "𝔟", "ℭ", "𝔠", "𝔇", "𝔡", "𝔈", "𝔢", "𝔉", "𝔣", "𝔊", "𝔤", "ℌ", "𝔥", "ℑ", "𝔦", "𝔍", "𝔧", "𝔎", "𝔨", "𝔏", "𝔩", "𝔑", "𝔫", "𝔐", "𝔪", "𝔒", "𝔬", "𝔓", "𝔭", "𝔔", "𝔮", "ℜ", "𝔯", "𝔖", "𝔰", "𝔗", "𝔱", "𝔘", "𝔲", "𝔙", "𝔳", "𝔚", "𝔴", "𝔛", "𝔵", "𝔜", "𝔶", "ℨ", "𝔷"];
Znaki.BOldEnglish= [`𝕬`, `𝖆`, `𝕭`, `𝖇`, `𝕮`, `𝖈`, `𝕯`, `𝖉`, `𝕰`, `𝖊`, `𝕱`, `𝖋`, `𝕲`, `𝖌`, `𝕳`, `𝖍`, `𝕴`, `𝖎`, `𝕵`, `𝖏`, `𝕶`, `𝖐`, `𝕷`, `𝖑`,  `𝕹`, `𝖓`, `𝕸`, `𝖒`, `𝕺`, `𝖔`, `𝕻`, `𝖕`, `𝕼`, `𝖖`, `𝕽`, `𝖗`, `𝕾`, `𝖘`, `𝕿`, `𝖙`, `𝖀`, `𝖚`, `𝖁`, `𝖛`,  `𝖂`, `𝖜`, `𝖃`, `𝖝`, `𝖄`, `𝖞`, `𝖅`, `𝖟`];
Znaki.Kontur= ["𝔸", "𝕒", "𝔹", "𝕓", "ℂ", "𝕔", "𝔻", "𝕕", "𝔼", "𝕖", "𝔽", "𝕗", "𝔾", "𝕘", "ℍ", "𝕙", "𝕀", "𝕚", "𝕁", "𝕛", "𝕂", "𝕜", "𝕃", "𝕝", "ℕ", "𝕟", "𝕄", "𝕞", "𝕆", "𝕠", "ℙ", "𝕡", "ℚ", "𝕢", "ℝ", "𝕣", "𝕊", "𝕤", "𝕋", "𝕥", "𝕌", "𝕦", "𝕍", "𝕧", "𝕎", "𝕨", "𝕏", "𝕩", "𝕐", "𝕪", "ℤ", "𝕫",];
Znaki.Kapitalki= ["ᴀ", "ᴀ", "ʙ", "ʙ", "ᴄ", "ᴄ", "ᴅ", "ᴅ", "ᴇ", "ᴇ", "ғ", "ғ", "ɢ", "ɢ", "ʜ", "ʜ", "ɪ", "ɪ", "ᴊ", "ᴊ", "ᴋ", "ᴋ", "ʟ", "ʟ", "ɴ", "ɴ", "ᴍ", "ᴍ", "ᴏ", "ᴏ", "ᴘ", "ᴘ", "ǫ", "ǫ", "ʀ", "ʀ", "s", "s", "ᴛ", "ᴛ", "ᴜ", "ᴜ", "ᴠ", "ᴠ", "ᴡ", "ᴡ", "x", "x", "ʏ", "ʏ", "ᴢ", "ᴢ"];
Znaki.Bkursywa= ["𝓐", "𝓪", "𝓑", "𝓫", "𝓒", "𝓬", "𝓓", "𝓭", "𝓔", "𝓮", "𝓕", "𝓯", "𝓖", "𝓰", "𝓗", "𝓱", "𝓘", "𝓲", "𝓙", "𝓳", "𝓚", "𝓴", "𝓛", "𝓵", "𝓝", "𝓷", "𝓜", "𝓶", "𝓞", "𝓸", "𝓟", "𝓹", "𝓠", "𝓺", "𝓡", "𝓻", "𝓢", "𝓼", "𝓣", "𝓽", "𝓤", "𝓾", "𝓥", "𝓿", "𝓦", "𝔀", "𝓧", "𝔁", "𝓨", "𝔂", "𝓩", "𝔃"];
Znaki.kursywa= ["𝒜", "𝒶", "ℬ", "𝒷", "𝒞", "𝒸", "𝒟", "𝒹", "ℰ", "𝑒", "ℱ", "𝒻", "𝒢", "𝑔", "ℋ", "𝒽", "ℐ", "𝒾", "𝒥", "𝒿", "𝒦", "𝓀", "ℒ", "𝓁", "𝒩", "𝓃", "ℳ", "𝓂", "𝒪", "𝑜", "𝒫", "𝓅", "𝒬", "𝓆", "ℛ", "𝓇", "𝒮", "𝓈", "𝒯", "𝓉", "𝒰", "𝓊", "𝒱", "𝓋", "𝒲", "𝓌", "𝒳", "𝓍", "𝒴", "𝓎", "𝒵", "𝓏"];
Znaki.kwadraciki= ["🄰", "🄰", "🄱", "🄱", "🄲", "🄲", "🄳", "🄳", "🄴", "🄴", "🄵", "🄵", "🄶", "🄶", "🄷", "🄷", "🄸", "🄸", "🄹", "🄹", "🄺", "🄺", "🄻", "🄻", "🄽", "🄽", "🄼", "🄼", "🄾", "🄾", "🄿", "🄿", "🅀", "🅀", "🅁", "🅁", "🅂", "🅂", "🅃", "🅃", "🅄", "🅄", "🅅", "🅅", "🅆", "🅆", "🅇", "🅇", "🅈", "🅈", "🅉", "🅉", "1⃣", "2⃣", "3⃣", "4⃣", "5⃣", "6⃣", "7⃣", "8⃣", "9⃣", "0⃣"];
Znaki.CzarneKola= ["🅐", "🅐", "🅑", "🅑", "🅒", "🅒", "🅓", "🅓", "🅔", "🅔", "🅕", "🅕", "🅖", "🅖", "🅗", "🅗", "🅘", "🅘", "🅙", "🅙", "🅚", "🅚", "🅛", "🅛", "🅝", "🅝", "🅜", "🅜", "🅞", "🅞", "🅟", "🅟", "🅠", "🅠", "🅡", "🅡", "🅢", "🅢", "🅣", "🅣", "🅤", "🅤", "🅥", "🅥", "🅦", "🅦", "🅧", "🅧", "🅨", "🅨", "🅩", "🅩",
                   "❶", "❷", "❸", "❹", "❺", "❻", "❼", "❽", "❾", "⓿"];
Znaki.BialeKola= ["Ⓐ", "ⓐ", "Ⓑ", "ⓑ", "Ⓒ", "ⓒ", "Ⓓ", "ⓓ", "Ⓔ", "ⓔ", "Ⓕ", "ⓕ", "Ⓖ", "ⓖ", "Ⓗ", "ⓗ", "Ⓘ", "ⓘ", "Ⓙ", "ⓙ", "Ⓚ", "ⓚ", "Ⓛ", "ⓛ", "Ⓝ", "ⓝ", "Ⓜ", "ⓜ", "Ⓞ", "ⓞ", "Ⓟ", "ⓟ", "Ⓠ", "ⓠ", "Ⓡ", "ⓡ", "Ⓢ", "ⓢ", "Ⓣ", "ⓣ", "Ⓤ", "ⓤ", "Ⓥ", "ⓥ", "Ⓦ", "ⓦ", "Ⓧ", "ⓧ", "Ⓨ", "ⓨ", "Ⓩ", "ⓩ", "①", "②", "③", "④", "⑤", "⑥",
                  "⑦", "⑧", "⑨", "⓪"];
function zamiana(rodzaj, tekst) {
    switch(rodzaj){
        case `1`:
            rodzaj=Znaki.OldEnglish;
            break;
        case `2`:
            rodzaj=Znaki.BOldEnglish;
            break;
        case `3`:
            rodzaj=Znaki.Kontur;
            break;
        case `4`:
            rodzaj=Znaki.Kapitalki;
            break;
        case `5`:
            rodzaj=Znaki.Bkursywa;
            break;
        case `6`:
            rodzaj=Znaki.kursywa;
            break;
        case `7`:
            rodzaj=Znaki.kwadraciki;
            break;
        case `8`:
            rodzaj=Znaki.CzarneKola;
            break;
        case `9`:
            rodzaj=Znaki.BialeKola;
            break;
    }
    let tekst2= "";
    for(let i=0;i<tekst.length;i++){
        if (Znaki.normal.indexOf(tekst[i]) !== -1)
        tekst2+= `${rodzaj[Znaki.normal.indexOf(tekst[i])]}`;
        else {tekst2+=tekst[i];}  
    }
    document.getElementById("odwrocony").innerHTML="<h2>"+tekst2+"</h2>";
}
